DISP-ORD.
	READ ORDER KEY IS ORD-CODE
	INVALID KEY GO TO ERR-CUS-NOT-FOUND.
	PERFORM DISP-ORD-CUS-NAME.
DISP-ORD-CUS-NAME.
	MOVE ORD-CUSTOMER TO CUS-CODE
	READ CUSTOMER INVALID KEY
		DISPLAY "ERROR : UNKOWN CUSTOMER"
	NOT INVALID KEY
		DISPLAY "ORD-CODE: " ORD-CODE NAME.