	MOVE CUS-CODE TO ORD-CUSTOMER.
	START ORDER KEY >= ORD-CUSTOMER.
	MOVE 0 TO END-FILE.
	PERFORM READ-ORD UNTIL END-FILE = 1.
READ-ORD SECTION.
BEG-ORD.
	READ ORDER NEXT
	AT END MOVE 1 TO END-FILE GO TO EXIT-ORD.
	<<processing current ORD record>>
EXIT-ORD.
	EXIT.